brew "fontconfig"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "deno"
brew "docker"
brew "docker-compose"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "go"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "neovim"
brew "nodebrew"
brew "pnpm"
brew "poppler"
brew "resvg"
brew "sevenzip"
brew "starship"
brew "uv"
brew "yazi"
brew "zoxide"
cask "antigravity"
cask "claude"
cask "claude-code"
cask "cursor"
cask "docker-desktop"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-myrica"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "raycast"
cask "visual-studio-code"
vscode "antfu.slidev"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "vue.volar"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
